In [14]:
## Using the employee_data_na.CSV file, please answer the following questions:

 ## 1. Are there NA values in the data at all? 
 ## 2. Find out in which columns the NA values are? 
 ## 3. Use the sum() function to find out how many missing values there are in total? 
 ## 4. How about by variable? 
 ## 5. Edit the observations 
 ## 6. Reload the data and delete the rows with missing values using the na.omit() function

# Import the `readr` package
library(readr)

path = "F:\\R-Aptech\\BT08\\employee_data_na.csv"
# Read the `employee_data_na.csv` file
employee_data <- read_csv(path)

head(employee_data)

Rows: 1000 Columns: 9
── Column specification ────────────────────────────────────────────────────────
Delimiter: ","
chr (7): first_name, last_name, birth_date, gender, title, latest_start_date...
dbl (2): emp_no, salary

ℹ Use `spec()` to retrieve the full column specification for this data.
ℹ Specify the column types or set `show_col_types = FALSE` to quiet this message.

  emp_no first_name last_name birth_date gender title           salary
1 10001  Georgi     Facello   02/09/1953 M      Senior Engineer    NA
2 10002  Bezalel    Simmel    02/06/1964 F      Staff           65828
3 10003  Parto      Bamford   03/12/1959 M      Senior Engineer 40006
4 10004  Chirstian  Koblick   01/05/1954 M      Engineer        40054
5 10005  Kyoichi    Maliniak  21/01/1955 M      Senior Staff    78228
6 10006  Anneke     Preusig   20/04/1953 F      Senior Engineer 40000
  latest_start_date end_of_contract_date
1 22/06/2010        01/01/9999
2 02/08/2001        01/01/9999
3 01/12/2001        01/01/9999
4 27/11/2001        01/01/9999
5 09/09/2001        01/01/9999
6 02/08/2001        01/01/9999

In [4]:
## 1. Are there NA values in the data at all? 
anyNA(employee_data)

[1] TRUE

In [8]:
## 2. Find out in which columns the NA values are? 
na_columns <- colSums(is.na(employee_data))

print(na_columns[na_columns > 0])

gender salary
    17     70

In [9]:
 ## 3. Use the sum() function to find out how many missing values there are in total? 
total_na <- sum(is.na(employee_data))

print(total_na)

[1] 87

In [10]:
 ## 4. How about by variable? 
na_by_variable <- colSums(is.na(employee_data))

print(na_by_variable)

              emp_no           first_name            last_name
                   0                    0                    0
          birth_date               gender                title
                   0                   17                    0
              salary    latest_start_date end_of_contract_date
                  70                    0                    0

In [18]:
 ## 6. Reload the data and delete the rows with missing values using the na.omit() function
employee_data <- na.omit(employee_data)

In [12]:
# Check again if there are any NA values in the data
anyNA(employee_data)

[1] FALSE

In [19]:
## Reload the data
head(employee_data)

  emp_no first_name last_name birth_date gender title           salary
1 10002  Bezalel    Simmel    02/06/1964 F      Staff           65828
2 10003  Parto      Bamford   03/12/1959 M      Senior Engineer 40006
3 10004  Chirstian  Koblick   01/05/1954 M      Engineer        40054
4 10005  Kyoichi    Maliniak  21/01/1955 M      Senior Staff    78228
5 10006  Anneke     Preusig   20/04/1953 F      Senior Engineer 40000
6 10007  Tzvetan    Zielinski 23/05/1957 F      Senior Staff    56724
  latest_start_date end_of_contract_date
1 02/08/2001        01/01/9999
2 01/12/2001        01/01/9999
3 27/11/2001        01/01/9999
4 09/09/2001        01/01/9999
5 02/08/2001        01/01/9999
6 07/02/2002        01/01/9999